import { z } from 'zod';

export const questSchema = z.object({
  name: z
    .string({
      required_error: 'Поле "Ваше ім’я" є обов’язковим',
    })
    .min(2, 'Мінімальна довжина 2 символи'),
  phone: z
    .string({
      required_error: 'Поле "Ваш номер телефону" є обов’язковим',
    })
    .min(10, 'Мінімальна довжина 10 символів')
    .max(13, 'Максимальна довжина 10 символів')
    .regex(/^\d+(\.\d+)?$/, 'Повинно містити число')
    .nullable(),
  peopleCount: z
    .string({
      required_error: 'Поле "Кількість гравців" є обов’язковим',
    })
    .min(1, 'Кількість гравців повинна бути не менше 1')
    .max(100, 'Кількість гравців повинна бути не більше 100'),
  isLegal: z
    .boolean({
      required_error: 'Погодження з правилами є обов’язковим',
    })
    .refine(
      val => val === true,
      'Ви повинні погодитися з правилами обробки персональних даних та угодою користувачів'
    ),
});
